In [1]:
from mydbutils import make_connection, do_query_return_all
from pandas import DataFrame
import mysql.connector

In [2]:
conn_warehouse = make_connection(config_file = 'pinnacle_wh.ini')
cursor_warehouse = conn_warehouse.cursor()
conn = make_connection(config_file = 'pinnacle_db.ini')
cursor = conn.cursor()

In [3]:
def make_table(table, sql):
    cursor_warehouse.execute(f"DROP TABLE IF EXISTS {table}")
    cursor_warehouse.execute(sql)

In [4]:
def display_table(table, order_by=''):
    sql = f"SELECT * FROM {table}"
    
    if order_by != '':
        sql = sql + " ORDER BY " + order_by
    
    cursor_warehouse.execute(sql)

    columns = cursor_warehouse.description
    column_names = [column_info[0] for column_info in columns]

    df = DataFrame(cursor_warehouse.fetchall())
    df.columns = column_names
    
    return df

# Calendar dimension

In [6]:
sql = ( """
        CREATE TABLE calendar
        (
            calendar_key INT NOT NULL AUTO_INCREMENT,
            full_date DATE,
            day_of_week VARCHAR(9),
            day_of_month INT,
            month INT,
            qtr INT,
            year INT,
            PRIMARY KEY (calendar_key)
        )
        """
      )

make_table('calendar', sql)

In [7]:
sql = ( """
        INSERT INTO pinnacle_wh.calendar(full_date, day_of_week, 
                                            day_of_month, month, 
                                            qtr, year)
            SELECT DISTINCT requiredDate, dayname(requiredDate), 
                            day(requiredDate), month(requiredDate), 
                            quarter(requiredDate), year(requiredDate)
            FROM pinnacle_db.orders
            WHERE status = 'Shipped'
        """
      )

cursor_warehouse.execute(sql)
conn_warehouse.commit()

display_table('calendar', 'full_date')

     calendar_key   full_date day_of_week  day_of_month  month  qtr  year
0               1  2003-01-13      Monday            13      1    1  2003
1               2  2003-01-18    Saturday            18      1    1  2003
2               3  2003-02-07      Friday             7      2    1  2003
3               4  2003-02-09      Sunday             9      2    1  2003
4               5  2003-02-21      Friday            21      2    1  2003
..            ...         ...         ...           ...    ...  ...   ...
244           245  2005-05-13      Friday            13      5    2  2005
245           246  2005-05-14    Saturday            14      5    2  2005
246           247  2005-05-16      Monday            16      5    2  2005
247           248  2005-05-24     Tuesday            24      5    2  2005
248           249  2005-05-28    Saturday            28      5    2  2005

[249 rows x 7 columns]

# Sales Rep Employee dimension

In [8]:
sql = ( """
        CREATE TABLE salesrepemployee
        (
            employeeNumber INT NOT NULL,
            lastName VARCHAR(50),
            firstName VARCHAR(50),
            email VARCHAR(100),
            managerName VARCHAR(100),
            managerEmail VARCHAR(100),
            PRIMARY KEY(employeeNumber)
        )
        """
      )
make_table('salesrepemployee', sql)

In [9]:
sql = ( """
        INSERT INTO pinnacle_wh.salesrepemployee(employeeNumber, 
                                                   lastName,
                                                   firstName,
                                                   email,
                                                   managerName,
                                                   managerEmail)
            SELECT em1.employeeNumber, em1.lastName, em1.firstName, em1.email, concat(em2.firstName, ' ', em2.lastName) as managerName, em2.email as managerEmail
            FROM pinnacle_db.employees em1
            LEFT JOIN pinnacle_db.employees em2 ON em1.reportsTo = em2.employeeNumber
            WHERE em1.jobTitle = 'Sales Rep'
        """
      )

cursor.execute(sql)
conn.commit()

display_table('salesrepemployee', 'managerName')

,employeeNumber,lastName,firstName,email,managerName,managerEmail
0,1165,Jennings,Leslie,ljennings@classicmodelcars.com,Anthony Bow,abow@classicmodelcars.com
1,1166,Thompson,Leslie,lthompson@classicmodelcars.com,Anthony Bow,abow@classicmodelcars.com
2,1188,Firrelli,Julie,jfirrelli@classicmodelcars.com,Anthony Bow,abow@classicmodelcars.com
3,1216,Patterson,Steve,spatterson@classicmodelcars.com,Anthony Bow,abow@classicmodelcars.com
4,1286,Tseng,Foon Yue,ftseng@classicmodelcars.com,Anthony Bow,abow@classicmodelcars.com
5,1323,Vanauf,George,gvanauf@classicmodelcars.com,Anthony Bow,abow@classicmodelcars.com
6,1337,Bondur,Loui,lbondur@classicmodelcars.com,Gerard Bondur,gbondur@classicmodelcars.com
7,1370,Hernandez,Gerard,ghernande@classicmodelcars.com,Gerard Bondur,gbondur@classicmodelcars.com
8,1401,Castillo,Pamela,pcastillo@classicmodelcars.com,Gerard Bondur,gbondur@classicmodelcars.com
9,1501,Bott,Larry,lbott@classicmodelcars.com,Gerard Bondur,gbondur@classicmodelcars.com
10,1504,Jones,Barry,bjones@classicmodelcars.com,Gerard Bondur,gbondur@classicmodelcars.com
11,1702,Gerard,Martin,mgerard@classicmodelcars.com,Gerard Bondur,gbondur@classicmodelcars.com
12,1625,Kato,Yoshimi,ykato@classicmodelcars.com,Mami Nishi,mnishi@classicmodelcars.com
13,1621,Nishi,Mami,mnishi@classicmodelcars.com,Mary Patterson,mpatterso@classicmodelcars.com
14,1611,Fixter,Andy,afixter@classicmodelcars.com,William Patterson,wpatterson@classicmodelcars.com
15,1612,Marsh,Peter,pmarsh@classicmodelcars.com,William Patterson,wpatterson@classicmodelcars.com
16,1619,King,Tom,tking@classicmodelcars.com,William Patterson,wpatterson@classicmodelcars.com

# Product Line Dimension

#### Only get products that have been ordered

In [13]:
sql = ( """
        CREATE TABLE productLine
        (
            productLineID INT NOT NULL AUTO_INCREMENT,
            productLineName VARCHAR(100),
            PRIMARY KEY(productLineID)
        )
        """
      )
make_table('productLine', sql)

In [15]:
sql = ( """
        INSERT INTO pinnacle_wh.productLine(productLineName)
            SELECT distinct productLine FROM pinnacle_db.products
        """
      )

cursor.execute(sql)
conn.commit()

display_table('productLine', 'productLineID')

   productLineID   productLineName
0              1      Classic Cars
1              2       Motorcycles
2              3            Planes
3              4             Ships
4              5            Trains
5              6  Trucks and Buses
6              7      Vintage Cars

# Products Dimension

In [5]:
sql = ( """
        CREATE TABLE products
        (
            productCode varchar(15) NOT NULL,
            productName VARCHAR(100),
            productDescription text NOT NULL,
            buyPrice decimal(10,2) NOT NULL,
            PRIMARY KEY(productCode)
        )
        """
      )
make_table('products', sql)

In [6]:
sql = ( """
        INSERT INTO pinnacle_wh.products(productCode,
                                            productName,
                                            productDescription,
                                            buyPrice)
            SELECT productCode, productName, productDescription, buyPrice 
            FROM pinnacle_db.products
            WHERE productCode in (Select productCode from pinnacle_db.orderdetails)
        """
      )

cursor.execute(sql)
conn.commit()

display_table('products', 'productCode')

,productCode,productName,productDescription,buyPrice
0,S10_1678,1969 Harley Davidson Ultimate Chopper,"This replica features working kickstand, front...",48.81
1,S10_1949,1952 Alpine Renault 1300,Turnable front wheels; steering function; deta...,98.58
2,S10_2016,1996 Moto Guzzi 1100i,"Official Moto Guzzi logos and insignias, saddl...",68.99
3,S10_4698,2003 Harley-Davidson Eagle Drag Bike,"Model features, official Harley Davidson logos...",91.02
4,S10_4757,1972 Alfa Romeo GTA,Features include: Turnable front wheels; steer...,85.68
...,...,...,...,...
104,S700_3505,The Titanic,"Completed model measures 19 1/2 inches long, 9...",51.09
105,S700_3962,The Queen Mary,Exact replica. Wood and Metal. Many extras inc...,53.63
106,S700_4002,American Airlines: MD-11S,Polished finish. Exact replia with official lo...,36.27
107,S72_1253,Boeing X-32A JSF,"10"" Wingspan with retractable landing gears.Co...",32.77
108,S72_3212,Pont Yacht,Measures 38 inches Long x 33 3/4 inches High. ...,33.30

# Customers Dimension

In [8]:
sql = ( """
        CREATE TABLE customers
        (
            customerNumber INT NOT NULL,
            customerName VARCHAR(100),
            contactLastName VARCHAR(100),
            contactFirstName VARCHAR(100),
            phone VARCHAR(50),
            city VARCHAR(50),
            country VARCHAR(50),
            PRIMARY KEY(customerNumber)
        )
        """
      )
make_table('customers', sql)

In [9]:
sql = ( """
        INSERT INTO pinnacle_wh.customers(customerNumber,
                                            customerName,
                                            contactLastName,
                                            contactFirstName,
                                            phone,
                                            city,
                                            country)
            SELECT customerNumber, customerName, contactLastName, contactFirstName, phone, city, country
            FROM pinnacle_db.customers
            WHERE salesRepEmployeeNumber is not NULL
        """
      )

cursor.execute(sql)
conn.commit()

display_table('customers', 'customerNumber')

,customerNumber,customerName,contactLastName,contactFirstName,phone,city,country
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,Nantes,France
1,112,Signal Gift Stores,King,Jean,7025551838,Las Vegas,USA
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,Melbourne,Australia
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,Nantes,France
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Stavern,Norway
...,...,...,...,...,...,...,...
95,486,Motor Mint Distributors Inc.,Salazar,Rosa,2155559857,Philadelphia,USA
96,487,Signal Collectibles Ltd.,Taylor,Sue,4155554312,Brisbane,USA
97,489,"Double Decker Gift Stores, Ltd",Smith,Thomas,(171) 555-7555,London,UK
98,495,Diecast Collectables,Franco,Valarie,6175552555,Boston,USA
99,496,Kelly's Gift Shop,Snowden,Tony,+64 9 5555500,Auckland,New Zealand

# Sales fact table

In [10]:
sql = ( """
        CREATE TABLE shippedorders
        (
            orderNumber INT NOT NULL,
            calendar_key INT NOT NULL,
            customerNumber INT NOT NULL,
            salesRepEmployeeNumber INT NOT NULL,
            productCode varchar(15) NOT NULL,
            productLineID INT NOT NULL,
            quantityOrdered INT NOT NULL,
            priceEach decimal(10,2) NOT NULL,
            PRIMARY KEY(orderNumber, calendar_key, customerNumber, salesRepEmployeeNumber, productCode, productLineID)
        )
        """
      )

make_table('shippedorders', sql)

In [11]:
sql = ( """
        INSERT INTO pinnacle_wh.shippedorders(orderNumber,
                                                calendar_key,
                                                customerNumber,
                                                salesRepEmployeeNumber,
                                                productCode,
                                                productLineID,
                                                quantityOrdered,
                                                priceEach)
            SELECT o.orderNumber, ca.calendar_key, cus.customerNumber, cus.salesRepEmployeeNumber, 
                od.productCode, pl.productLineID, od.quantityOrdered, od.priceEach FROM pinnacle_db.orders o
                JOIN pinnacle_db.orderdetails od on od.orderNumber = o.orderNumber
                JOIN pinnacle_db.products pro on pro.productCode = od.productCode
                JOIN pinnacle_wh.productline pl on pl.productLineName = pro.productLine
                JOIN pinnacle_db.customers cus on cus.customerNumber = o.customerNumber
                JOIN pinnacle_wh.calendar ca on ca.full_date = o.requiredDate
                WHERE o.status = 'Shipped'
        """
      )

cursor.execute(sql)
conn.commit()

display_table('shippedorders', 'orderNumber')

,orderNumber,calendar_key,customerNumber,salesRepEmployeeNumber,productCode,productLineID,quantityOrdered,priceEach
0,10100,1,363,1216,S18_1749,7,30,136.00
1,10100,1,363,1216,S18_2248,7,50,55.09
2,10100,1,363,1216,S18_4409,7,22,75.46
3,10100,1,363,1216,S24_3969,7,49,35.29
4,10101,2,128,1504,S18_2325,7,25,108.06
...,...,...,...,...,...,...,...,...
2766,10419,249,382,1401,S18_3232,1,35,165.95
2767,10419,249,382,1401,S18_3685,1,43,114.44
2768,10419,249,382,1401,S24_2972,1,15,32.10
2769,10419,249,382,1401,S24_3371,1,55,52.66
2770,10419,249,382,1401,S24_3856,1,70,112.34

# I. Quaterly sales per employee

In [6]:
conn_warehouse = make_connection(config_file = 'pinnacle_wh.ini')
cursor_warehouse = conn_warehouse.cursor()

import pandas as  pd
pd.set_option("display.max_columns", None)
sql = ( """
        SELECT sa.firstName, sa.lastName, sa.managerName, ca.qtr, ca.year, (sh.quantityOrdered*sh.priceEach)
        FROM pinnacle_wh.shippedorders sh
        JOIN pinnacle_wh.salesrepemployee sa ON sa.employeeNumber = sh.salesRepEmployeeNumber
        JOIN pinnacle_wh.calendar ca ON ca.calendar_key = sh.calendar_key
        GROUP BY sa.firstName, sa.lastName, sa.managerName, ca.qtr, ca.year
        ORDER BY sa.firstName, sa.lastName, ca.year, ca.qtr
        """
      )
# print(sql)
rows, count = do_query_return_all(conn_warehouse, sql)
if count > 0:
    df = pd.DataFrame(rows)
    df.columns = ['First Name', 'Last Name', 'Manager Name', 'Quater', 'YearEnd', 'Revenue Made']
print(df.to_string())

    First Name  Last Name       Manager Name  Quater  YearEnd Revenue Made
0         Andy     Fixter  William Patterson       2     2003      3449.26
1         Andy     Fixter  William Patterson       3     2003      2770.78
2         Andy     Fixter  William Patterson       4     2003      4121.95
3         Andy     Fixter  William Patterson       1     2004      2974.43
4         Andy     Fixter  William Patterson       3     2004      3365.10
5         Andy     Fixter  William Patterson       4     2004      4755.60
6         Andy     Fixter  William Patterson       1     2005      4498.55
7        Barry      Jones      Gerard Bondur       1     2003      2701.50
8        Barry      Jones      Gerard Bondur       2     2003      5717.64
9        Barry      Jones      Gerard Bondur       4     2003      1491.38
10       Barry      Jones      Gerard Bondur       1     2004      6051.20
11       Barry      Jones      Gerard Bondur       3     2004      6173.55
12       Barry      Jones      Gerard Bondur       4     2004      3884.34
13       Barry      Jones      Gerard Bondur       1     2005      4755.40
14    Foon Yue      Tseng        Anthony Bow       1     2003      3726.45
15    Foon Yue      Tseng        Anthony Bow       2     2003      5123.94
16    Foon Yue      Tseng        Anthony Bow       4     2003      4455.36
17    Foon Yue      Tseng        Anthony Bow       2     2004      2113.01
18    Foon Yue      Tseng        Anthony Bow       3     2004      2565.72
19    Foon Yue      Tseng        Anthony Bow       4     2004      4021.50
20    Foon Yue      Tseng        Anthony Bow       2     2005      4731.79
21      George     Vanauf        Anthony Bow       1     2003      2440.50
22      George     Vanauf        Anthony Bow       2     2003      2980.32
23      George     Vanauf        Anthony Bow       3     2003      2834.10
24      George     Vanauf        Anthony Bow       4     2003      4599.42
25      George     Vanauf        Anthony Bow       2     2004      2832.40
26      George     Vanauf        Anthony Bow       3     2004      3026.00
27      George     Vanauf        Anthony Bow       4     2004      3922.58
28      George     Vanauf        Anthony Bow       2     2005      7256.52
29      Gerard  Hernandez      Gerard Bondur       1     2003      4468.96
30      Gerard  Hernandez      Gerard Bondur       2     2003      3138.46
31      Gerard  Hernandez      Gerard Bondur       3     2003      3932.74
32      Gerard  Hernandez      Gerard Bondur       4     2003      4031.40
33      Gerard  Hernandez      Gerard Bondur       1     2004      3892.98
34      Gerard  Hernandez      Gerard Bondur       2     2004      2508.66
35      Gerard  Hernandez      Gerard Bondur       3     2004      3660.75
36      Gerard  Hernandez      Gerard Bondur       4     2004      4128.54
37      Gerard  Hernandez      Gerard Bondur       1     2005      1607.76
38      Gerard  Hernandez      Gerard Bondur       2     2005      2217.28
39       Julie   Firrelli        Anthony Bow       3     2003      6530.72
40       Julie   Firrelli        Anthony Bow       4     2003      4140.23
41       Julie   Firrelli        Anthony Bow       1     2004      6214.70
42       Julie   Firrelli        Anthony Bow       2     2004      5257.89
43       Julie   Firrelli        Anthony Bow       3     2004      5301.71
44       Julie   Firrelli        Anthony Bow       4     2004      2603.04
45       Julie   Firrelli        Anthony Bow       1     2005      3481.80
46       Larry       Bott      Gerard Bondur       1     2003      4374.14
47       Larry       Bott      Gerard Bondur       2     2003      4084.08
48       Larry       Bott      Gerard Bondur       3     2003      2413.95
49       Larry       Bott      Gerard Bondur       4     2003      4134.40
50       Larry       Bott      Gerard Bondur       1     2004      3217.46
51       Larry       Bott      Gerard Bondur       2     2004      2103.99
52       Larry       Bott      Gerard Bondur       4     2004      1760.88
53       Larry       Bott      Gerard Bondur       1     2005      5971.35
54       Larry       Bott      Gerard Bondur       2     2005      2044.08
55      Leslie   Jennings        Anthony Bow       1     2003      2881.89
56      Leslie   Jennings        Anthony Bow       2     2003      2554.44
57      Leslie   Jennings        Anthony Bow       3     2003      7273.14
58      Leslie   Jennings        Anthony Bow       4     2003      3986.15
59      Leslie   Jennings        Anthony Bow       1     2004      4550.40
60      Leslie   Jennings        Anthony Bow       2     2004      6670.35
61      Leslie   Jennings        Anthony Bow       3     2004      3085.74
62      Leslie   Jennings        Anthony Bow       4     2004     10286.40
63      Leslie   Jennings        Anthony Bow       1     2005      4004.88
64      Leslie   Jennings        Anthony Bow       2     2005      5138.76
65      Leslie   Thompson        Anthony Bow       2     2003      3213.00
66      Leslie   Thompson        Anthony Bow       3     2003      3445.20
67      Leslie   Thompson        Anthony Bow       4     2003      2332.13
68      Leslie   Thompson        Anthony Bow       1     2004      5038.80
69      Leslie   Thompson        Anthony Bow       3     2004      3898.10
70      Leslie   Thompson        Anthony Bow       4     2004      3711.12
71      Leslie   Thompson        Anthony Bow       1     2005      3452.75
72        Loui     Bondur      Gerard Bondur       2     2003      3984.43
73        Loui     Bondur      Gerard Bondur       3     2003      3727.72
74        Loui     Bondur      Gerard Bondur       4     2003      8550.78
75        Loui     Bondur      Gerard Bondur       1     2004      8124.98
76        Loui     Bondur      Gerard Bondur       2     2004      1495.60
77        Loui     Bondur      Gerard Bondur       3     2004      1960.80
78        Loui     Bondur      Gerard Bondur       4     2004      5828.79
79        Loui     Bondur      Gerard Bondur       1     2005      1834.56
80        Loui     Bondur      Gerard Bondur       2     2005      4319.04
81        Mami      Nishi     Mary Patterson       1     2003      5457.54
82        Mami      Nishi     Mary Patterson       2     2003      6445.89
83        Mami      Nishi     Mary Patterson       3     2003      8197.20
84        Mami      Nishi     Mary Patterson       4     2003      7406.08
85        Mami      Nishi     Mary Patterson       1     2004      2598.77
86        Mami      Nishi     Mary Patterson       2     2004      5164.77
87        Mami      Nishi     Mary Patterson       3     2004      2611.84
88        Mami      Nishi     Mary Patterson       4     2004      5057.90
89        Mami      Nishi     Mary Patterson       1     2005      5862.00
90        Mami      Nishi     Mary Patterson       2     2005       615.45
91      Martin     Gerard      Gerard Bondur       2     2003      3101.40
92      Martin     Gerard      Gerard Bondur       4     2003      2607.51
93      Martin     Gerard      Gerard Bondur       1     2004      4998.00
94      Martin     Gerard      Gerard Bondur       3     2004      4004.28
95      Martin     Gerard      Gerard Bondur       4     2004      2617.86
96      Pamela   Castillo      Gerard Bondur       1     2003      6392.00
97      Pamela   Castillo      Gerard Bondur       2     2003      1627.56
98      Pamela   Castillo      Gerard Bondur       3     2003      1128.20
99      Pamela   Castillo      Gerard Bondur       4     2003      2285.91
100     Pamela   Castillo      Gerard Bondur       1     2004      2430.12
101     Pamela   Castillo      Gerard Bondur       2     2004      4521.72
102     Pamela   Castillo      Gerard Bondur       3     2004      8304.12
103     Pamela   Castillo      Gerard Bondur       4     2004      6711.94
104     Pamela   Castillo      Gerard Bondur       1     2005      3966.10
105     Pamela   Castillo      Gerard Bondur       2     2005      3103.44
106      Peter      Marsh  William Patterson       3     2003      2880.00
107      Peter      Marsh  William Patterson       4     2003      1659.90
108      Peter      Marsh  William Patterson       1     2004      6382.56
109      Peter      Marsh  William Patterson       2     2004      5679.36
110      Peter      Marsh  William Patterson       3     2004      4581.01
111      Peter      Marsh  William Patterson       4     2004      3537.24
112      Peter      Marsh  William Patterson       1     2005      5076.40
113      Peter      Marsh  William Patterson       2     2005      3100.80
114      Steve  Patterson        Anthony Bow       1     2003      4080.00
115      Steve  Patterson        Anthony Bow       2     2003      2752.80
116      Steve  Patterson        Anthony Bow       4     2003      5873.37
117      Steve  Patterson        Anthony Bow       3     2004      2805.12
118      Steve  Patterson        Anthony Bow       4     2004      4940.38
119      Steve  Patterson        Anthony Bow       1     2005      3376.38

# a) Drill Up - sales per year for employee

In [14]:
sql = ( """
        SELECT sa.firstName, sa.lastName, sa.managerName, ca.year, (sh.quantityOrdered*sh.priceEach)
        FROM pinnacle_wh.shippedorders sh
        JOIN pinnacle_wh.salesrepemployee sa ON sa.employeeNumber = sh.salesRepEmployeeNumber
        JOIN pinnacle_wh.calendar ca ON ca.calendar_key = sh.calendar_key
        GROUP BY sa.firstName, sa.lastName, sa.managerName, ca.year
        ORDER BY sa.firstName, sa.lastName, ca.year
        """
      )
# print(sql)
rows, count = do_query_return_all(conn_warehouse, sql)
if count > 0:
    df = pd.DataFrame(rows)
    df.columns = ['First Name', 'Last Name', 'Manager Name', 'YearEnd', 'Revenue Made']
print(df.to_string())

   First Name  Last Name       Manager Name  YearEnd Revenue Made
0        Andy     Fixter  William Patterson     2003      3449.26
1        Andy     Fixter  William Patterson     2004      2974.43
2        Andy     Fixter  William Patterson     2005      4498.55
3       Barry      Jones      Gerard Bondur     2003      2701.50
4       Barry      Jones      Gerard Bondur     2004      6051.20
5       Barry      Jones      Gerard Bondur     2005      4755.40
6    Foon Yue      Tseng        Anthony Bow     2003      3726.45
7    Foon Yue      Tseng        Anthony Bow     2004      2113.01
8    Foon Yue      Tseng        Anthony Bow     2005      4731.79
9      George     Vanauf        Anthony Bow     2003      2440.50
10     George     Vanauf        Anthony Bow     2004      2832.40
11     George     Vanauf        Anthony Bow     2005      7256.52
12     Gerard  Hernandez      Gerard Bondur     2003      4468.96
13     Gerard  Hernandez      Gerard Bondur     2004      3892.98
14     Gerard  Hernandez      Gerard Bondur     2005      1607.76
15      Julie   Firrelli        Anthony Bow     2003      6530.72
16      Julie   Firrelli        Anthony Bow     2004      6214.70
17      Julie   Firrelli        Anthony Bow     2005      3481.80
18      Larry       Bott      Gerard Bondur     2003      4374.14
19      Larry       Bott      Gerard Bondur     2004      3217.46
20      Larry       Bott      Gerard Bondur     2005      5971.35
21     Leslie   Jennings        Anthony Bow     2003      2881.89
22     Leslie   Jennings        Anthony Bow     2004      4550.40
23     Leslie   Jennings        Anthony Bow     2005      4004.88
24     Leslie   Thompson        Anthony Bow     2003      3213.00
25     Leslie   Thompson        Anthony Bow     2004      5038.80
26     Leslie   Thompson        Anthony Bow     2005      3452.75
27       Loui     Bondur      Gerard Bondur     2003      3984.43
28       Loui     Bondur      Gerard Bondur     2004      8124.98
29       Loui     Bondur      Gerard Bondur     2005      1834.56
30       Mami      Nishi     Mary Patterson     2003      5457.54
31       Mami      Nishi     Mary Patterson     2004      2598.77
32       Mami      Nishi     Mary Patterson     2005      5862.00
33     Martin     Gerard      Gerard Bondur     2003      3101.40
34     Martin     Gerard      Gerard Bondur     2004      4998.00
35     Pamela   Castillo      Gerard Bondur     2003      6392.00
36     Pamela   Castillo      Gerard Bondur     2004      2430.12
37     Pamela   Castillo      Gerard Bondur     2005      3966.10
38      Peter      Marsh  William Patterson     2003      2880.00
39      Peter      Marsh  William Patterson     2004      6382.56
40      Peter      Marsh  William Patterson     2005      5076.40
41      Steve  Patterson        Anthony Bow     2003      4080.00
42      Steve  Patterson        Anthony Bow     2004      2805.12
43      Steve  Patterson        Anthony Bow     2005      3376.38

# b) Drill down - sales per month for each employee

In [15]:
sql = ( """
        SELECT sa.firstName, sa.lastName, sa.managerName, ca.month, ca.year, (sh.quantityOrdered*sh.priceEach)
        FROM pinnacle_wh.shippedorders sh
        JOIN pinnacle_wh.salesrepemployee sa ON sa.employeeNumber = sh.salesRepEmployeeNumber
        JOIN pinnacle_wh.calendar ca ON ca.calendar_key = sh.calendar_key
        GROUP BY sa.firstName, sa.lastName, sa.managerName, ca.month, ca.year
        ORDER BY sa.firstName, sa.lastName, ca.year, ca.month
        """
      )
# print(sql)
rows, count = do_query_return_all(conn_warehouse, sql)
if count > 0:
    df = pd.DataFrame(rows)
    df.columns = ['First Name', 'Last Name', 'Manager Name', 'Month', 'YearEnd', 'Revenue Made']
print(df.to_string())

    First Name  Last Name       Manager Name  Month  YearEnd Revenue Made
0         Andy     Fixter  William Patterson      5     2003      3449.26
1         Andy     Fixter  William Patterson      7     2003      2770.78
2         Andy     Fixter  William Patterson      9     2003      2636.95
3         Andy     Fixter  William Patterson     10     2003      4121.95
4         Andy     Fixter  William Patterson     11     2003      4903.20
5         Andy     Fixter  William Patterson      2     2004      2974.43
6         Andy     Fixter  William Patterson      7     2004      3365.10
7         Andy     Fixter  William Patterson     12     2004      4755.60
8         Andy     Fixter  William Patterson      2     2005      4498.55
9         Andy     Fixter  William Patterson      3     2005      4680.24
10       Barry      Jones      Gerard Bondur      1     2003      2701.50
11       Barry      Jones      Gerard Bondur      2     2003      5571.80
12       Barry      Jones      Gerard Bondur      4     2003      5717.64
13       Barry      Jones      Gerard Bondur     10     2003      1491.38
14       Barry      Jones      Gerard Bondur     11     2003      4202.82
15       Barry      Jones      Gerard Bondur      2     2004      6051.20
16       Barry      Jones      Gerard Bondur      3     2004      5522.06
17       Barry      Jones      Gerard Bondur      8     2004      6173.55
18       Barry      Jones      Gerard Bondur      9     2004      3513.86
19       Barry      Jones      Gerard Bondur     10     2004      3884.34
20       Barry      Jones      Gerard Bondur     11     2004      5730.04
21       Barry      Jones      Gerard Bondur      3     2005      4755.40
22    Foon Yue      Tseng        Anthony Bow      1     2003      3726.45
23    Foon Yue      Tseng        Anthony Bow      4     2003      5123.94
24    Foon Yue      Tseng        Anthony Bow      6     2003      8889.50
25    Foon Yue      Tseng        Anthony Bow     10     2003      4455.36
26    Foon Yue      Tseng        Anthony Bow     11     2003      4706.10
27    Foon Yue      Tseng        Anthony Bow     12     2003      9571.08
28    Foon Yue      Tseng        Anthony Bow      4     2004      2113.01
29    Foon Yue      Tseng        Anthony Bow      5     2004      6630.34
30    Foon Yue      Tseng        Anthony Bow      6     2004      3157.92
31    Foon Yue      Tseng        Anthony Bow      7     2004      2565.72
32    Foon Yue      Tseng        Anthony Bow     11     2004      4021.50
33    Foon Yue      Tseng        Anthony Bow     12     2004      4318.60
34    Foon Yue      Tseng        Anthony Bow      5     2005      4731.79
35      George     Vanauf        Anthony Bow      3     2003      2440.50
36      George     Vanauf        Anthony Bow      6     2003      2980.32
37      George     Vanauf        Anthony Bow      9     2003      2834.10
38      George     Vanauf        Anthony Bow     11     2003      4599.42
39      George     Vanauf        Anthony Bow     12     2003      5806.50
40      George     Vanauf        Anthony Bow      4     2004      2832.40
41      George     Vanauf        Anthony Bow      5     2004      5533.61
42      George     Vanauf        Anthony Bow      7     2004      3026.00
43      George     Vanauf        Anthony Bow      8     2004      3264.00
44      George     Vanauf        Anthony Bow      9     2004      1990.80
45      George     Vanauf        Anthony Bow     10     2004      3922.58
46      George     Vanauf        Anthony Bow     11     2004      3376.38
47      George     Vanauf        Anthony Bow     12     2004      1938.87
48      George     Vanauf        Anthony Bow      5     2005      7256.52
49      Gerard  Hernandez      Gerard Bondur      2     2003      4468.96
50      Gerard  Hernandez      Gerard Bondur      5     2003      3138.46
51      Gerard  Hernandez      Gerard Bondur      6     2003      4928.20
52      Gerard  Hernandez      Gerard Bondur      7     2003      3932.74
53      Gerard  Hernandez      Gerard Bondur     10     2003      4031.40
54      Gerard  Hernandez      Gerard Bondur     11     2003      3166.08
55      Gerard  Hernandez      Gerard Bondur     12     2003      3229.80
56      Gerard  Hernandez      Gerard Bondur      1     2004      3892.98
57      Gerard  Hernandez      Gerard Bondur      2     2004      5759.42
58      Gerard  Hernandez      Gerard Bondur      3     2004      6087.94
59      Gerard  Hernandez      Gerard Bondur      4     2004      2508.66
60      Gerard  Hernandez      Gerard Bondur      5     2004      3986.40
61      Gerard  Hernandez      Gerard Bondur      6     2004      3240.00
62      Gerard  Hernandez      Gerard Bondur      8     2004      3660.75
63      Gerard  Hernandez      Gerard Bondur     10     2004      4128.54
64      Gerard  Hernandez      Gerard Bondur     11     2004      2812.32
65      Gerard  Hernandez      Gerard Bondur     12     2004      1676.14
66      Gerard  Hernandez      Gerard Bondur      2     2005      1607.76
67      Gerard  Hernandez      Gerard Bondur      3     2005      3214.35
68      Gerard  Hernandez      Gerard Bondur      4     2005      2217.28
69      Gerard  Hernandez      Gerard Bondur      5     2005      5439.42
70       Julie   Firrelli        Anthony Bow      8     2003      6530.72
71       Julie   Firrelli        Anthony Bow      9     2003      7751.52
72       Julie   Firrelli        Anthony Bow     11     2003      4140.23
73       Julie   Firrelli        Anthony Bow     12     2003      3892.98
74       Julie   Firrelli        Anthony Bow      3     2004      6214.70
75       Julie   Firrelli        Anthony Bow      5     2004      5257.89
76       Julie   Firrelli        Anthony Bow      7     2004      5301.71
77       Julie   Firrelli        Anthony Bow      8     2004      9242.00
78       Julie   Firrelli        Anthony Bow      9     2004      4424.40
79       Julie   Firrelli        Anthony Bow     10     2004      2603.04
80       Julie   Firrelli        Anthony Bow      1     2005      3481.80
81       Larry       Bott      Gerard Bondur      3     2003      4374.14
82       Larry       Bott      Gerard Bondur      6     2003      4084.08
83       Larry       Bott      Gerard Bondur      8     2003      2413.95
84       Larry       Bott      Gerard Bondur      9     2003      2758.80
85       Larry       Bott      Gerard Bondur     10     2003      4134.40
86       Larry       Bott      Gerard Bondur     11     2003      3949.11
87       Larry       Bott      Gerard Bondur      1     2004      3217.46
88       Larry       Bott      Gerard Bondur      3     2004      2944.92
89       Larry       Bott      Gerard Bondur      4     2004      2103.99
90       Larry       Bott      Gerard Bondur      5     2004      8594.52
91       Larry       Bott      Gerard Bondur     10     2004      1760.88
92       Larry       Bott      Gerard Bondur     11     2004      4173.84
93       Larry       Bott      Gerard Bondur     12     2004      5596.50
94       Larry       Bott      Gerard Bondur      1     2005      5971.35
95       Larry       Bott      Gerard Bondur      2     2005      4614.48
96       Larry       Bott      Gerard Bondur      4     2005      2044.08
97      Leslie   Jennings        Anthony Bow      3     2003      2881.89
98      Leslie   Jennings        Anthony Bow      4     2003      2554.44
99      Leslie   Jennings        Anthony Bow      7     2003      7273.14
100     Leslie   Jennings        Anthony Bow      8     2003      6898.28
101     Leslie   Jennings        Anthony Bow      9     2003      4366.50
102     Leslie   Jennings        Anthony Bow     10     2003      3986.15
103     Leslie   Jennings        Anthony Bow     11     2003      3410.64
104     Leslie   Jennings        Anthony Bow     12     2003      1810.60
105     Leslie   Jennings        Anthony Bow      2     2004      4550.40
106     Leslie   Jennings        Anthony Bow      3     2004      6944.00
107     Leslie   Jennings        Anthony Bow      5     2004      6670.35
108     Leslie   Jennings        Anthony Bow      6     2004      4609.50
109     Leslie   Jennings        Anthony Bow      7     2004      3085.74
110     Leslie   Jennings        Anthony Bow      8     2004      7241.83
111     Leslie   Jennings        Anthony Bow     10     2004     10286.40
112     Leslie   Jennings        Anthony Bow     11     2004      2434.25
113     Leslie   Jennings        Anthony Bow     12     2004      6377.60
114     Leslie   Jennings        Anthony Bow      1     2005      4004.88
115     Leslie   Jennings        Anthony Bow      2     2005      5718.72
116     Leslie   Jennings        Anthony Bow      3     2005      4392.80
117     Leslie   Jennings        Anthony Bow      4     2005      5138.76
118     Leslie   Thompson        Anthony Bow      5     2003      3213.00
119     Leslie   Thompson        Anthony Bow      9     2003      3445.20
120     Leslie   Thompson        Anthony Bow     10     2003      2332.13
121     Leslie   Thompson        Anthony Bow     11     2003      3879.96
122     Leslie   Thompson        Anthony Bow     12     2003      1101.13
123     Leslie   Thompson        Anthony Bow      1     2004      5038.80
124     Leslie   Thompson        Anthony Bow      2     2004      7200.55
125     Leslie   Thompson        Anthony Bow      3     2004      4113.88
126     Leslie   Thompson        Anthony Bow      8     2004      3898.10
127     Leslie   Thompson        Anthony Bow     12     2004      3711.12
128     Leslie   Thompson        Anthony Bow      2     2005      3452.75
129       Loui     Bondur      Gerard Bondur      4     2003      3984.43
130       Loui     Bondur      Gerard Bondur      5     2003      2928.42
131       Loui     Bondur      Gerard Bondur      7     2003      3727.72
132       Loui     Bondur      Gerard Bondur     12     2003      8550.78
133       Loui     Bondur      Gerard Bondur      1     2004      8124.98
134       Loui     Bondur      Gerard Bondur      3     2004      2131.75
135       Loui     Bondur      Gerard Bondur      6     2004      1495.60
136       Loui     Bondur      Gerard Bondur      9     2004      1960.80
137       Loui     Bondur      Gerard Bondur     11     2004      5828.79
138       Loui     Bondur      Gerard Bondur     12     2004      3942.36
139       Loui     Bondur      Gerard Bondur      1     2005      1834.56
140       Loui     Bondur      Gerard Bondur      3     2005      4003.84
141       Loui     Bondur      Gerard Bondur      4     2005      4319.04
142       Mami      Nishi     Mary Patterson      3     2003      5457.54
143       Mami      Nishi     Mary Patterson      4     2003      6445.89
144       Mami      Nishi     Mary Patterson      9     2003      8197.20
145       Mami      Nishi     Mary Patterson     10     2003      7406.08
146       Mami      Nishi     Mary Patterson     11     2003      3155.40
147       Mami      Nishi     Mary Patterson     12     2003      6292.02
148       Mami      Nishi     Mary Patterson      1     2004      2598.77
149       Mami      Nishi     Mary Patterson      4     2004      5164.77
150       Mami      Nishi     Mary Patterson      6     2004      5691.84
151       Mami      Nishi     Mary Patterson      8     2004      2611.84
152       Mami      Nishi     Mary Patterson     11     2004      5057.90
153       Mami      Nishi     Mary Patterson      2     2005      5862.00
154       Mami      Nishi     Mary Patterson      3     2005      3516.04
155       Mami      Nishi     Mary Patterson      4     2005       615.45
156     Martin     Gerard      Gerard Bondur      4     2003      3101.40
157     Martin     Gerard      Gerard Bondur      6     2003      7817.74
158     Martin     Gerard      Gerard Bondur     11     2003      2607.51
159     Martin     Gerard      Gerard Bondur     12     2003      5324.40
160     Martin     Gerard      Gerard Bondur      2     2004      4998.00
161     Martin     Gerard      Gerard Bondur      3     2004      4255.20
162     Martin     Gerard      Gerard Bondur      9     2004      4004.28
163     Martin     Gerard      Gerard Bondur     10     2004      2617.86
164     Martin     Gerard      Gerard Bondur     11     2004      9974.40
165     Martin     Gerard      Gerard Bondur     12     2004      3435.30
166     Pamela   Castillo      Gerard Bondur      2     2003      6392.00
167     Pamela   Castillo      Gerard Bondur      4     2003      1627.56
168     Pamela   Castillo      Gerard Bondur      5     2003      5192.48
169     Pamela   Castillo      Gerard Bondur      8     2003      1128.20
170     Pamela   Castillo      Gerard Bondur     10     2003      2285.91
171     Pamela   Castillo      Gerard Bondur     11     2003      5464.69
172     Pamela   Castillo      Gerard Bondur      2     2004      2430.12
173     Pamela   Castillo      Gerard Bondur      4     2004      4521.72
174     Pamela   Castillo      Gerard Bondur      6     2004      3178.66
175     Pamela   Castillo      Gerard Bondur      7     2004      8304.12
176     Pamela   Castillo      Gerard Bondur      8     2004      6994.82
177     Pamela   Castillo      Gerard Bondur      9     2004      8602.92
178     Pamela   Castillo      Gerard Bondur     11     2004      6711.94
179     Pamela   Castillo      Gerard Bondur     12     2004      5624.79
180     Pamela   Castillo      Gerard Bondur      1     2005      3966.10
181     Pamela   Castillo      Gerard Bondur      3     2005      2264.77
182     Pamela   Castillo      Gerard Bondur      5     2005      3103.44
183      Peter      Marsh  William Patterson      7     2003      2880.00
184      Peter      Marsh  William Patterson     12     2003      1659.90
185      Peter      Marsh  William Patterson      2     2004      6382.56
186      Peter      Marsh  William Patterson      4     2004      5679.36
187      Peter      Marsh  William Patterson      6     2004      6747.30
188      Peter      Marsh  William Patterson      7     2004      4581.01
189      Peter      Marsh  William Patterson      9     2004      2414.20
190      Peter      Marsh  William Patterson     12     2004      3537.24
191      Peter      Marsh  William Patterson      3     2005      5076.40
192      Peter      Marsh  William Patterson      4     2005      3100.80
193      Peter      Marsh  William Patterson      5     2005       625.50
194      Steve  Patterson        Anthony Bow      1     2003      4080.00
195      Steve  Patterson        Anthony Bow      6     2003      2752.80
196      Steve  Patterson        Anthony Bow     10     2003      5873.37
197      Steve  Patterson        Anthony Bow     11     2003      2674.08
198      Steve  Patterson        Anthony Bow      7     2004      2805.12
199      Steve  Patterson        Anthony Bow      8     2004      5850.68
200      Steve  Patterson        Anthony Bow      9     2004      3445.20
201      Steve  Patterson        Anthony Bow     10     2004      4940.38
202      Steve  Patterson        Anthony Bow     11     2004      3874.12
203      Steve  Patterson        Anthony Bow     12     2004      1727.99
204      Steve  Patterson        Anthony Bow      3     2005      3376.38